---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.SpaceTag.Space
source: html/7fa4b1d8-2459-a46b-f68f-0a3a78a8383d.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceTag.Space Property

The space that the tag is associated with.

## Syntax (C#)
```csharp
public Space Space { get; }
```

## Remarks
In rare cases, the tag may not be associated to a space. The property will
be Nothing nullptr a null reference ( Nothing in Visual Basic) in these situations.